#ifndef COM_DRIVE_H
#define COM_DRIVE_H

/****************************************************************************
 * 功能：打开串口
 * 参数：portname - 设备节点名称
 *		baudrate  - 通信波特率
 *		errmsg     - 错误提示信息（64字节缓存）
 *	返回：>=0 设备句柄，<0 失败
****************************************************************************/
int com_open(char* portname, int baudrate, char* errmsg) ;

/****************************************************************************
 * 功能：关闭串口
 * 参数：port_h - 设备句柄
 *	返回：
****************************************************************************/
void com_close(int port_h);

/****************************************************************************
 * 功能：等待串口接收数据到达
 * 参数：port_h   - 设备句柄
 * 		timeout - 超时时间(毫秒)
 *	返回：0-数据到达，1-超时，-1-未知错误
****************************************************************************/
int com_wait(int port_h, int timeout);

/****************************************************************************
 * 功能：发送数据
 * 参数：port_h   - 设备句柄
 * 		data      - 发送数据缓存
 * 		len        - 预发送数据字节
 *	返回：实际发送数据字节
****************************************************************************/
int com_send(int port_h, char* data, int len);

/****************************************************************************
 * 功能：接收数据
 * 参数：port_h   - 设备句柄
 * 			data      - 接收数据缓存
 * 			len        - 预接收数据字节
 *	返回：实际接收数据字节
****************************************************************************/
int com_recv(int port_h, char* data, int len) ;

#endif
