#ifndef __COM_FUNC_H__
#define __COM_FUNC_H__

/****************************************************************************
 * 功能：灯开关控制
 * 参数：state - 0 关灯 1 开灯
 * 返回：0 成功 其他 失败
****************************************************************************/
int comLightControl(unsigned char state);

/****************************************************************************
 * 功能：灯开关控制
 * 参数：state - 0 关灯 1 开灯
 * 返回：0 成功 其他 失败
****************************************************************************/
int comLightStateControl(unsigned char state);


#endif
